/*

На броду који тоне налази се n особа. 
У сваки чамац за спасавање могу стати највише две особе 
и то само ако њихова укупна маса није строго већа од носивости чамца 
(носивост чамца је таква да свака особа сигурно може сама да се превезе). 
Напиши програм који одређује најмањи број чамаца којим се све особе могу спасити.

Улаз
Са стандардног улаза се учитава носивост чамца (број M између 80 и 300), 
затим број особа n (1≤n≤105) и на крају низ маса особа раздвојених размацима.

Излаз
На стандардни излаз исписати најмањи број чамаца потребан да се сви превезу.

Пример 1
Улаз
300
4
200 100 200 200
Излаз
3
Пример 2
Улаз
80
4
40 20 40 40
Излаз
2
Пример 3
Улаз
120
3
20 40 60
Излаз
2
Пример 4
Улаз
150
10
10 20 30 40 50 60 70 80 90 100
Излаз
5
Пример 5
Улаз
80
5
40 40 50 40 40
Излаз
3

*/

#include <iostream>
#include <algorithm>
using namespace std;

int main() {
    int M, n;
    cin >> M >> n;
    int weights[n];
    for (int i = 0; i < n; i++) {
        cin >> weights[i];
    }
    sort(weights, weights + n);

    int boats = 0;
    int i = 0, j = n - 1;
    while (i <= j) {
        if (weights[i] + weights[j] <= M) {
            i++;
            j--;
        } else {
            j--;
        }
        boats++;
    }
    cout << boats << endl;
    return 0;
}
